package hw03frequencyanalysis

import (
	"testing"

	"github.com/stretchr/testify/require"
)

var text = `Как видите, он  спускается  по  лестнице  вслед  за  своим
	другом   Кристофером   Робином,   головой   вниз,  пересчитывая
	ступеньки собственным затылком:  бум-бум-бум.  Другого  способа
	сходить  с  лестницы  он  пока  не  знает.  Иногда ему, правда,
		кажется, что можно бы найти какой-то другой способ, если бы  он
	только   мог   на  минутку  перестать  бумкать  и  как  следует
	сосредоточиться. Но увы - сосредоточиться-то ему и некогда.
		Как бы то ни было, вот он уже спустился  и  готов  с  вами
	познакомиться.
	- Винни-Пух. Очень приятно!
		Вас,  вероятно,  удивляет, почему его так странно зовут, а
	если вы знаете английский, то вы удивитесь еще больше.
		Это необыкновенное имя подарил ему Кристофер  Робин.  Надо
	вам  сказать,  что  когда-то Кристофер Робин был знаком с одним
	лебедем на пруду, которого он звал Пухом. Для лебедя  это  было
	очень   подходящее  имя,  потому  что  если  ты  зовешь  лебедя
	громко: "Пу-ух! Пу-ух!"- а он  не  откликается,  то  ты  всегда
	можешь  сделать вид, что ты просто понарошку стрелял; а если ты
	звал его тихо, то все подумают, что ты  просто  подул  себе  на
	нос.  Лебедь  потом  куда-то делся, а имя осталось, и Кристофер
	Робин решил отдать его своему медвежонку, чтобы оно не  пропало
	зря.
		А  Винни - так звали самую лучшую, самую добрую медведицу
	в  зоологическом  саду,  которую  очень-очень  любил  Кристофер
	Робин.  А  она  очень-очень  любила  его. Ее ли назвали Винни в
	честь Пуха, или Пуха назвали в ее честь - теперь уже никто  не
	знает,  даже папа Кристофера Робина. Когда-то он знал, а теперь
	забыл.
		Словом, теперь мишку зовут Винни-Пух, и вы знаете почему.
		Иногда Винни-Пух любит вечерком во что-нибудь поиграть,  а
	иногда,  особенно  когда  папа  дома,  он больше любит тихонько
	посидеть у огня и послушать какую-нибудь интересную сказку.
		В этот вечер...`

func TestTop10(t *testing.T) {
	t.Run("basic variant", func(t *testing.T) {
		t.Run("empty string", func(t *testing.T) {
			require.Len(t, Top10(""), 0)
		})

		t.Run("positive test", func(t *testing.T) {
			expected := []string{
				"он",        // 8
				"а",         // 6
				"и",         // 6
				"ты",        // 5
				"что",       // 5
				"-",         // 4
				"Кристофер", // 4
				"если",      // 4
				"не",        // 4
				"то",        // 4
			}
			require.Equal(t, expected, Top10(text))
		})

		t.Run("positive custom test", func(t *testing.T) {
			tests := []struct {
				input    string
				expected []string
			}{
				{
					input: "Слово слово! слово слово'",
					expected: []string{
						"Слово",
						"слово",
						"слово!",
						"слово'",
					},
				},
				{
					input: "- - - hello",
					expected: []string{
						"-",
						"hello",
					},
				},
				{
					input: "какой-то какойто",
					expected: []string{
						"какой-то",
						"какойто",
					},
				},
			}

			for _, test := range tests {
				t.Run(test.input, func(t *testing.T) {
					result := Top10(test.input)
					require.Equal(t, test.expected, result)
				})
			}
		})
	})

	t.Run("normalized variant", func(t *testing.T) {
		t.Run("empty string", func(t *testing.T) {
			require.Len(t, Top10Normalized(""), 0)
		})

		t.Run("positive test", func(t *testing.T) {
			expected := []string{
				"а",         // 8
				"он",        // 8
				"и",         // 6
				"ты",        // 5
				"что",       // 5
				"в",         // 4
				"его",       // 4
				"если",      // 4
				"кристофер", // 4
				"не",        // 4
			}
			require.Equal(t, expected, Top10Normalized(text))
		})

		t.Run("positive custom test", func(t *testing.T) {
			positiveTests := []struct {
				input    string
				expected []string
			}{
				{
					input: "Три ТРИ три",
					expected: []string{
						"три",
					},
				},
				{
					input:    "- - - hello",
					expected: []string{"hello"},
				},
				{
					input:    "--- hello",
					expected: []string{"---", "hello"},
				},
				{
					input: `Страх убивает разум.
				 Страх - это малая смерть, несущая забвение. 
				 Я смотрю в лицо моему страху, я дам ему овладеть мною и пройти сквозь меня.
                 И когда он пройдет сквозь меня, я обернусь и посмотрю на тропу страха.
				 Там, где прошел страх, не останется ничего. 
				 Там, где прошел страх, останусь только я.`,
					expected: []string{
						"страх",  // 4
						"я",      // 4
						"и",      // 3
						"где",    // 2
						"меня",   // 2
						"прошел", // 2
						"сквозь", // 2
						"там",    // 2
						"в",      // 1
						"дам",    // 1
					},
				},
				{
					input:    "a b c d e f g h i j k l m n o",
					expected: []string{"a", "b", "c", "d", "e", "f", "g", "h", "i", "j"},
				},
			}

			for _, test := range positiveTests {
				t.Run(test.input, func(t *testing.T) {
					result := Top10Normalized(test.input)
					require.Equal(t, test.expected, result)
				})
			}
		})
	})
}
